app/Controllers/Home.php

SELECT *
FROM `categories`
SELECT *
FROM `product`
---
    public function filter()
    {
        $id= $this->request->getvar('id');
        $sub_category= $this->request->getvar('sub_cat');
        $model = new Category();
        $this->data['category_all'] = $model->findAll();
        $this->data['sub_category'] = $model->findAll();

        $model = new Products();
        if(isset($id))
        {
            $this->data['products'] = $model->product_byid($id);
        }
        elseif(isset($sub_category))
        {
            $this->data['products'] = $model->product_bysub_cat($sub_category);
            $array = $model->sub_cat($sub_category);
            $parent_id=reset($array);
            $model = new Category();
            $this->data['sub_category'] = $model->sub_category_parent($parent_id);
        }
        else
        {
            $this->data['products'] = $model->findAll();