app/Models/cart.php

SELECT *
FROM `cart_2`
WHERE `cart_2`.`session_id` = 'eqpll19tjgd28vgnulmofs1c7cvdom3p'
---
    public function getData($session_id)
    {
        $result = $this->where(['cart_2.session_id' => $session_id])->findAll();

SELECT *
FROM `cart_2`
WHERE `cart_2`.`session_id` = 'eqpll19tjgd28vgnulmofs1c7cvdom3p'
---
    public function get_rows($session_id)
    {
        $result = $this->where(['cart_2.session_id' => $session_id])->findAll();